Saturday, 19/06/2021

In [13]:
# Calling all data(s) from a table
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT * FROM pembeli;
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

   id                Nama                 Alamat
0   1         Andi Subudi             Rowocacing
1   2     Saitama Muktadi       Kedungwuni Barat
2   3     Muhammad Naruto       Kedungwuni Utara
3   4     Zulfikar Sasuke     Kedungwuni Selatan
4   5  Sakura Putri Beban    Pekalongan Tenggara
5   6       Obito Saputra  Pekalongan Barat Laut
6   7     Arditya Kakashi       Kedungwuni Utara
7   8         Rin Saputri                   Podo
8   9        Ahmad Minato       Kedungwuni Utara

In [15]:
# Call a column from a table
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT Nama FROM pembeli;
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

                 Nama
0         Andi Subudi
1     Saitama Muktadi
2     Muhammad Naruto
3     Zulfikar Sasuke
4  Sakura Putri Beban
5       Obito Saputra
6     Arditya Kakashi
7         Rin Saputri
8        Ahmad Minato

In [16]:
# Call some tables using comma as a separator
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT id, Nama FROM pembeli;
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

   id                Nama
0   1         Andi Subudi
1   2     Saitama Muktadi
2   3     Muhammad Naruto
3   4     Zulfikar Sasuke
4   5  Sakura Putri Beban
5   6       Obito Saputra
6   7     Arditya Kakashi
7   8         Rin Saputri
8   9        Ahmad Minato

In [17]:
# Call all data(s) with row-limit
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT * FROM pembeli LIMIT 5;
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

   id                Nama               Alamat
0   1         Andi Subudi           Rowocacing
1   2     Saitama Muktadi     Kedungwuni Barat
2   3     Muhammad Naruto     Kedungwuni Utara
3   4     Zulfikar Sasuke   Kedungwuni Selatan
4   5  Sakura Putri Beban  Pekalongan Tenggara

In [19]:
# Use of Prefix
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT pembeli.Nama FROM pembeli LIMIT 5;
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

                 Nama
0         Andi Subudi
1     Saitama Muktadi
2     Muhammad Naruto
3     Zulfikar Sasuke
4  Sakura Putri Beban

In [23]:
# Use of AS
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT Nama AS Name,Alamat AS Address FROM pembeli;
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

                 Name                Address
0         Andi Subudi             Rowocacing
1     Saitama Muktadi       Kedungwuni Barat
2     Muhammad Naruto       Kedungwuni Utara
3     Zulfikar Sasuke     Kedungwuni Selatan
4  Sakura Putri Beban    Pekalongan Tenggara
5       Obito Saputra  Pekalongan Barat Laut
6     Arditya Kakashi       Kedungwuni Utara
7         Rin Saputri                   Podo
8        Ahmad Minato       Kedungwuni Utara

In [25]:
# Defining a.k.a without AS operator
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT Nama Name,Alamat Address FROM pembeli;
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

                 Name                Address
0         Andi Subudi             Rowocacing
1     Saitama Muktadi       Kedungwuni Barat
2     Muhammad Naruto       Kedungwuni Utara
3     Zulfikar Sasuke     Kedungwuni Selatan
4  Sakura Putri Beban    Pekalongan Tenggara
5       Obito Saputra  Pekalongan Barat Laut
6     Arditya Kakashi       Kedungwuni Utara
7         Rin Saputri                   Podo
8        Ahmad Minato       Kedungwuni Utara

In [26]:
# Combine AS and Prefix
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT pembeli.Nama AS Name, pembeli.Alamat AS Address FROM pembeli;
"""
df = pd.read_sql(myquery,conn)
print(df)

                 Name                Address
0         Andi Subudi             Rowocacing
1     Saitama Muktadi       Kedungwuni Barat
2     Muhammad Naruto       Kedungwuni Utara
3     Zulfikar Sasuke     Kedungwuni Selatan
4  Sakura Putri Beban    Pekalongan Tenggara
5       Obito Saputra  Pekalongan Barat Laut
6     Arditya Kakashi       Kedungwuni Utara
7         Rin Saputri                   Podo
8        Ahmad Minato       Kedungwuni Utara

In [27]:
# AS from table
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT * FROM pembeli AS Buyer;
"""
df = pd.read_sql(myquery,conn)
print(df)

   id                Nama                 Alamat
0   1         Andi Subudi             Rowocacing
1   2     Saitama Muktadi       Kedungwuni Barat
2   3     Muhammad Naruto       Kedungwuni Utara
3   4     Zulfikar Sasuke     Kedungwuni Selatan
4   5  Sakura Putri Beban    Pekalongan Tenggara
5   6       Obito Saputra  Pekalongan Barat Laut
6   7     Arditya Kakashi       Kedungwuni Utara
7   8         Rin Saputri                   Podo
8   9        Ahmad Minato       Kedungwuni Utara

In [29]:
# Prefix and AS for table
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT buyer.Nama,buyer.Alamat FROM pembeli AS buyer;
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

                 Nama                 Alamat
0         Andi Subudi             Rowocacing
1     Saitama Muktadi       Kedungwuni Barat
2     Muhammad Naruto       Kedungwuni Utara
3     Zulfikar Sasuke     Kedungwuni Selatan
4  Sakura Putri Beban    Pekalongan Tenggara
5       Obito Saputra  Pekalongan Barat Laut
6     Arditya Kakashi       Kedungwuni Utara
7         Rin Saputri                   Podo
8        Ahmad Minato       Kedungwuni Utara

In [30]:
# Using filter 'WHERE'
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT * FROM pembeli WHERE Alamat = 'Kedungwuni Utara';
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

   id             Nama            Alamat
0   3  Muhammad Naruto  Kedungwuni Utara
1   7  Arditya Kakashi  Kedungwuni Utara
2   9     Ahmad Minato  Kedungwuni Utara

In [31]:
# Using OR operator
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "mydata")

myquery = """
SELECT * FROM pembeli WHERE Alamat = 'Kedungwuni Barat' OR Alamat = 'Kedungwuni Utara';
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

   id             Nama            Alamat
0   2  Saitama Muktadi  Kedungwuni Barat
1   3  Muhammad Naruto  Kedungwuni Utara
2   7  Arditya Kakashi  Kedungwuni Utara
3   9     Ahmad Minato  Kedungwuni Utara

In [33]:
# Using AND operator
import mysql.connector
import pandas as pd
conn = mysql.connector.connect(host="localhost",
                               user = "root",
                               passwd = "***",
                               database = "covid19")

myquery = """
SELECT * FROM data_ WHERE Positif >10000 AND Meninggal > 1000;
"""
df = pd.read_sql(myquery,conn)
print(df)
conn.close()

   id            Bulan  Positif  Sembuh  Meninggal
0   5              Mei    26473    7308       1613
1   6  Juni(continues)    41431   16243       2276

Learning Source : www.dqlab.id